# SQL II: Grouping and Joining

_November 2, 2020_

Agenda:
- Practice with Grouping in SQLite
- Practice with different types of Joins in SQLite

<img src = "https://media.giphy.com/media/3oKIPnAiaMCws8nOsE/giphy.gif">

In [4]:
import sqlite3
import pandas as pd
import seaborn as sns
import numpy as np

## Part I. Grouping
Just like pandas, Sql support different types of grouping statements for performing aggregate functions and allow us to calculate various statistics for data.

Syntax:
`SELECT (*) FROM tables GROUP BY column`

In [5]:
# instantiate some data
np.random.seed(1234)

auto = pd.read_csv('auto-mpg.csv')
tips = sns.load_dataset('tips')
small_quiz = pd.DataFrame({"students":["Billy","Ijeoma","Kelvin"],
                          "projects":[1,2,1],
                          "grades":np.random.randint(80,100,3)})
small_grades = pd.DataFrame({"students":["Muhammad","Joe","Kelvin"],
                            "quiz_score":np.random.randint(0,10,3)})

In [6]:
tips.to_csv('tips.csv')

tips = pd.read_csv('tips.csv')

In [7]:
conn = sqlite3.connect('aggregate.db')
c = conn.cursor()

In [8]:
# insert these datasets into our db

#auto.to_sql('auto', con=conn)

tips.to_sql('tips', con=conn)
small_grades.to_sql('small_grade', con=conn)
small_quiz.to_sql('small_quiz',con=conn)

C:\Users\berns\anaconda3\lib\site-packages\pandas\core\generic.py:2653: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [7]:
# for the tips df/table, get the total number of man and woman

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3

In [10]:
tips.groupby(['sex']).count()

        Unnamed: 0  total_bill  tip  smoker  day  time  size
sex
Female          87          87   87      87   87    87    87
Male           157         157  157     157  157   157   157

In [15]:
group_by_sex = tips.groupby(['sex'])['sex'].value_counts()
group_by_sex

sex     sex
Female  Female     87
Male    Male      157
Name: sex, dtype: int64

In [14]:
group_by_sex.values

array([ 87, 157], dtype=int64)

Male      157
Female     87
Name: sex, dtype: int64

Syntax: `SELECT ___ FROM ___ GROUP BY ___`

In [17]:
# in sql 
query = """SELECT COUNT(sex), sex FROM tips GROUP BY sex"""
c.execute(query).fetchall()

[(87, 'Female'), (157, 'Male')]

In [18]:
tips

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
1             1       10.34  1.66    Male     No   Sun  Dinner     3
2             2       21.01  3.50    Male     No   Sun  Dinner     3
3             3       23.68  3.31    Male     No   Sun  Dinner     2
4             4       24.59  3.61  Female     No   Sun  Dinner     4
..          ...         ...   ...     ...    ...   ...     ...   ...
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

In [21]:
# using pandas, select the average amount tipped for time
pd_query = tips.groupby(['time'])['tip'].mean()
pd_query

time
Dinner    3.102670
Lunch     2.728088
Name: tip, dtype: float64

In [22]:
# use sql to recreate this query
query = """SELECT AVG(tip) FROM tips GROUP BY time"""
c.execute(query).fetchall()

[(3.102670454545454,), (2.7280882352941176,)]

We can also use `GROUP BY` with certain conditions, in conjunction with filtering and ordering.

You can use :

`SELECT ___ FROM ___ WHERE ___ GROUP BY ___ `

`SELECT ___ FROM ___ GROUP BY ___ HAVING ____ `

In [32]:
tips[tips['size']>2]

     Unnamed: 0  total_bill   tip     sex smoker  day    time  size
1             1       10.34  1.66    Male     No  Sun  Dinner     3
2             2       21.01  3.50    Male     No  Sun  Dinner     3
4             4       24.59  3.61  Female     No  Sun  Dinner     4
5             5       25.29  4.71    Male     No  Sun  Dinner     4
7             7       26.88  3.12    Male     No  Sun  Dinner     4
..          ...         ...   ...     ...    ...  ...     ...   ...
227         227       20.45  3.00    Male     No  Sat  Dinner     4
230         230       24.01  2.00    Male    Yes  Sat  Dinner     4
231         231       15.69  3.00    Male    Yes  Sat  Dinner     3
238         238       35.83  4.67  Female     No  Sat  Dinner     3
239         239       29.03  5.92    Male     No  Sat  Dinner     3

[84 rows x 8 columns]

In [35]:
# use pandas, get the average total bills for a party larger than 2 for every size of party
# using pandas
tips[tips['size']>2].groupby(['size'])['total_bill'].mean()

size
3    23.277632
4    28.613514
5    30.068000
6    34.830000
Name: total_bill, dtype: float64

In [28]:
# use sql to recreate this query
query = """SELECT AVG(total_bill), size FROM tips WHERE size > 2 GROUP BY size"""
c.execute(query).fetchall()

[(23.27763157894737, 3), (28.61351351351351, 4), (30.068, 5), (34.83, 6)]

In [43]:
tips

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
1             1       10.34  1.66    Male     No   Sun  Dinner     3
2             2       21.01  3.50    Male     No   Sun  Dinner     3
3             3       23.68  3.31    Male     No   Sun  Dinner     2
4             4       24.59  3.61  Female     No   Sun  Dinner     4
..          ...         ...   ...     ...    ...   ...     ...   ...
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

In [46]:
# your turn - use pandas, get the maximum value of total bill for female non smoker
tips[(tips['smoker'] == 'No') & (tips['sex'] == 'Female')]['total_bill'].max()
# using group by?

35.83

In [ ]:
# Hint - you can use this with out without group by

In [48]:
# use sql to recreate this query
query = """SELECT MAX(total_bill) FROM tips WHERE sex = 'Female' AND smoker = 'No'"""
c.execute(query).fetchall()

[(35.83,)]

In [36]:
tips

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0             0       16.99  1.01  Female     No   Sun  Dinner     2
1             1       10.34  1.66    Male     No   Sun  Dinner     3
2             2       21.01  3.50    Male     No   Sun  Dinner     3
3             3       23.68  3.31    Male     No   Sun  Dinner     2
4             4       24.59  3.61  Female     No   Sun  Dinner     4
..          ...         ...   ...     ...    ...   ...     ...   ...
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 8 columns]

In [41]:
# your turn - use pandas, get the average tip values for different size groups, and show top 2
tips.groupby(['size'])['tip'].mean().sort_values(ascending = False)[:2]
# most amount of average tips

size
6    5.225000
4    4.135405
Name: tip, dtype: float64

In [42]:
# use sql 
query = """SELECT AVG(tip) FROM tips GROUP BY size ORDER BY AVG(tip) DESC LIMIT 2"""
c.execute(query).fetchall()

[(5.225,), (4.135405405405407,)]

## Part II. Join

Based on this diagram, how would you explain the different types of joins?

<img src = 'sql-joins-better.png' width = 400>

In [ ]:
print(small_grades)
print(small_quiz)

In [49]:
# left join - join small quiz with small grades, on student name
small_grades.merge(small_quiz, on = 'students', how = 'left')

   students  quiz_score  projects  grades
0  Muhammad           5       NaN     NaN
1       Joe           4       NaN     NaN
2    Kelvin           8       1.0    86.0

In [53]:
# sql 
query = """SELECT * FROM small_grade LEFT JOIN small_quiz on small_grade.students = small_quiz.students"""
c.execute(query).fetchall()
# col = [i[0] for i in c.description]

[(0, 'Muhammad', 5, None, None, None, None),
 (1, 'Joe', 4, None, None, None, None),
 (2, 'Kelvin', 8, 2, 'Kelvin', 1, 86)]

In [54]:
print(col)

['index', 'students', 'quiz_score', 'index', 'students', 'projects', 'grades']

In [ ]:
# inner join and get the student's grades
small_grades.merge(small_quiz, on = 'students')

In [ ]:
query = """SELECT * FROM small_quiz JOIN small_grade ON small_grade.students = small_quiz.students"""
c.execute(query).fetchall()

In [ ]:
# your turn - use right join and get all entries

# pandas

In [ ]:
# sql

### Level up 
1. Subqueries (including anti-joins)
2. Get median (using OFFSET)

In [ ]:
# anti-join :get all the entries that are in the left table but not in the right table 
query = """SELECT left_table.id FROM `left table` WHERE left_table.id not in (SELECT id FROM right_table) """

In [ ]:
# get median - use offset 
query = """SELECT col FROM table ORDER BY col LIMIT 1 OFFSET (SELECT COUNT(*) FROM MyTable) / 2"""